电脑/python/python第三方模块/click模块.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:[11pt,oneside]
#+LATEX_HEADER: \usepackage{article}


#+TITLE: click模块
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@gmail.com">a358003542@gmail.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


* 简介
click模块是一个类似getopt和argparse的python第三方模块，在简单了解之后，觉得其简直就是python快速创建命令行工具的类似requests之于urllib的存在，writed human-friendly, 便民的。click的官方文档在 [[http://click.pocoo.org][这里]] ，下面就让我们来学习这么好的一个模块吧。

官方文档的第一个例子如下:
#+BEGIN_SRC python
import click

@click.command()
@click.option('--count', default=1, help='Number of greetings.')
@click.option('--name', prompt='Your name',
              help='The person to greet.')
def hello(count, name):
    """Simple program that greets NAME for a total of COUNT times."""
    for x in range(count):
        click.echo('Hello %s!' % name)

if __name__ == '__main__':
    hello()
#+END_SRC

我们看到一切都是很直观明了的， ~@click.command()~ 用来装饰一个函数，然后用 ~@click.option~ 来具体添加命令行选项。其中第一个就是命令行选项的名字，然后 ~help~ ， ~default~ 的意义我们是清楚的（类似的还有 ~type~ 来控制数据类型）。然后我们注意到某个选项比如上面的name是可以请求输入来获得值的。然后我们可以用 ~click.echo~ 来进行打印操作（不是print函数是为了获得更好的python2和3的兼容性，这个是随意的，直接用print函数也是可以的）。

具体脚本运行情况如下所示:
#+BEGIN_EXAMPLE
wanze@wanze-ubuntu:~/桌面$ python3 test2.py --help
Usage: test2.py [OPTIONS]

  Simple program that greets NAME for a total of COUNT times.

Options:
  --count INTEGER  Number of greetings.
  --name TEXT      The person to greet.
  --help           Show this message and exit.
#+END_EXAMPLE

我们看到该函数的 ~__doc__~ 说明文档就直接成了该命令行的描述性文档了。

更棒的是其 ~prompt~ 机制和具体命令行输入参数是兼容的:
#+BEGIN_EXAMPLE
wanze@wanze-ubuntu:~/桌面$ python3 test2.py --count=3 --name=wanze
Hello wanze!
Hello wanze!
Hello wanze!
#+END_EXAMPLE

