电脑/python/python第三方模块/click模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-02-23 二 12:27 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>click模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">click模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 简介</a></li>
<li><a href="#orgheadline3">2. 必填参数，文件操作和如何测试</a>
<ul>
<li><a href="#orgheadline2">2.1. 标准输入和标准输出</a></li>
</ul>
</li>
<li><a href="#orgheadline4">3. 分组和多个子命令</a></li>
<li><a href="#orgheadline15">4. 命令行选项详解</a>
<ul>
<li><a href="#orgheadline5">4.1. default</a></li>
<li><a href="#orgheadline6">4.2. type</a></li>
<li><a href="#orgheadline7">4.3. 接受多个输入</a></li>
<li><a href="#orgheadline8">4.4. count</a></li>
<li><a href="#orgheadline9">4.5. 布尔值</a></li>
<li><a href="#orgheadline10">4.6. 短名选项和长名选项和布尔值</a></li>
<li><a href="#orgheadline11">4.7. 多个choice选项的用法</a></li>
<li><a href="#orgheadline14">4.8. 请求输入prompt控制</a>
<ul>
<li><a href="#orgheadline12">4.8.1. 请求输入密码</a></li>
<li><a href="#orgheadline13">4.8.2. 请求的默认值控制</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">5. 全局环境变量控制</a></li>
<li><a href="#orgheadline17">6. 命令行选项控制其他动作</a></li>
<li><a href="#orgheadline18">7. 带颜色的终端回显</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">简介</h2>
<div class="outline-text-2" id="text-1">
<p>
click模块是一个类似getopt和argparse的python第三方模块，在简单了解之后，觉得其简直就是python快速创建命令行工具的类似requests之于urllib的存在，writed human-friendly, 便民的。click的官方文档在 <a href="http://click.pocoo.org/">这里</a> ，下面就让我们来学习这么好的一个模块吧。
</p>

<p>
官方文档的第一个例子如下:
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">click</span>

<span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--count&#39;</span><span class="p">,</span> <span class="n">default</span><span class="o">=</span><span class="mi">1</span><span class="p">,</span> <span class="n">help</span><span class="o">=</span><span class="s1">&#39;Number of greetings.&#39;</span><span class="p">)</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--name&#39;</span><span class="p">,</span> <span class="n">prompt</span><span class="o">=</span><span class="s1">&#39;Your name&#39;</span><span class="p">,</span>
              <span class="n">help</span><span class="o">=</span><span class="s1">&#39;The person to greet.&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">hello</span><span class="p">(</span><span class="n">count</span><span class="p">,</span> <span class="n">name</span><span class="p">):</span>
    <span class="sd">&quot;&quot;&quot;Simple program that greets NAME for a total of COUNT times.&quot;&quot;&quot;</span>
    <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">count</span><span class="p">):</span>
        <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Hello </span><span class="si">%s</span><span class="s1">!&#39;</span> <span class="o">%</span> <span class="n">name</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">hello</span><span class="p">()</span>
</pre></div>

<p>
我们看到一切都是很直观明了的， <code>@click.command()</code> 用来装饰一个函数，然后用 <code>@click.option</code> 来具体添加命令行选项。其中第一个就是命令行选项的名字，然后 <code>help</code> ， <code>default</code> 的意义我们是清楚的（类似的还有 <code>type</code> 来控制数据类型）。然后我们注意到某个选项比如上面的name是可以请求输入来获得值的。然后我们可以用 <code>click.echo</code> 来进行打印操作（不是print函数是为了获得更好的python2和3的兼容性，这个是随意的，直接用print函数也是可以的）。
</p>

<p>
具体脚本运行情况如下所示:
</p>
<pre>
wanze@wanze-ubuntu:~/桌面$ python3 test2.py --help
Usage: test2.py [OPTIONS]

  Simple program that greets NAME for a total of COUNT times.

Options:
  --count INTEGER  Number of greetings.
  --name TEXT      The person to greet.
  --help           Show this message and exit.
</pre>

<p>
我们看到该函数的 <code>__doc__</code> 说明文档就直接成了该命令行的描述性文档了。
</p>

<p>
更棒的是其 <code>prompt</code> 机制和具体命令行输入参数是兼容的:
</p>
<pre>
wanze@wanze-ubuntu:~/桌面$ python3 test2.py --count=3 --name=wanze
Hello wanze!
Hello wanze!
Hello wanze!
</pre>
</div>
</div>
