电脑/python/python第三方模块/click模块.org
* 必填参数，文件操作和如何测试
必填参数用 ~@click.argument()~ 来装饰添加之，如下所示:
#+BEGIN_SRC python
import click

@click.command()
@click.argument('input', type=click.File('rb'))
@click.argument('output', type=click.File('wb'))
def inout(input, output):
    while True:
        chunk = input.read(1024)
        if not chunk:
            break
        output.write(chunk)

if __name__ == '__main__':
    inout()
#+END_SRC

这里的 ~click.File()~ 接受一个文件名，然后就已经打开了，在函数里面直接作为一个文件对象可以使用了。文件就推荐使用click模块的这个类型来处理，其对Unicode和bytes处理较好，并有其他优化。当然你也可以使用 ~click.Path~ 类型，其在函数里面相当于一个优化的Path文件名，同样提供了Unicode和bytes兼容支持等。

#+BEGIN_SRC python
@click.command()
@click.argument('f', type=click.Path(exists=True))
def touch(f):
    click.echo(click.format_filename(f))
#+END_SRC

在上面的例子中我们看到脚本最后那里写上:
#+BEGIN_EXAMPLE
if __name__ == '__main__':
    inout()
#+END_EXAMPLE
脚本就可以正常测试了:
#+BEGIN_EXAMPLE
bash>>> python3 test5.py test.py output.txt
#+END_EXAMPLE

但是更好的做法是用测试式开发风格:

#+BEGIN_SRC python
import click

from click.testing import CliRunner

def test_inout():
    @click.command()
    @click.argument('input', type=click.File('rb'))
    @click.argument('output', type=click.File('wb'))
    def inout(input, output):
        while True:
            chunk = input.read(1024)
            if not chunk:
                break
            output.write(chunk)

    runner = CliRunner()

    with runner.isolated_filesystem():
        string = 'Hello World!'
        with open('hello.txt', 'w') as f:
            f.write(string)

        result = runner.invoke(inout, ['hello.txt','hello2.txt'])

        assert result.exit_code == 0
        with open('hello2.txt','r') as f:
            s = f.read()
            assert s == string


if __name__ == '__main__':
    test_inout()
#+END_SRC

具体是新建一个 ~CliRunner~ 对象，然后调用其 ~invoke~ 方法来具体执行某个命令，然后的 ~Result~ 对象有 ~exit_code~ 和 ~output~ 等属性。其中 ~result.output~ 一般为屏幕回显的文字。

然后我们看到上面的runner调用了 ~isolated_filesystem()~ 方法，通过暂停程序我们会发现这样在 ~/tmp~ 文件夹里面会出现一个临时文件夹，然后一切文件操作都在里面进行，完了就会被删除。


** 标准输入和标准输出
值得一提的是标准输入和标准输出可以用 '-' 简单表示。比如上面的例子:
#+BEGIN_EXAMPLE
bash>>> python3 test4.py - output.txt
test test

bash>>> python3 test4.py test.py -
#+END_EXAMPLE

标准输入的那个例子你需要按下 ~Ctrl-D~ 来结束文件流。



* 分组和多个子命令
click模块在分组和建立多个子命令功能上也设计得很简洁:
#+BEGIN_SRC python
import click

@click.group()
def cli():
    pass

@cli.command()
def initdb():
    click.echo('Initialized the database')

@cli.command()
def dropdb():
    click.echo('Dropped the database')

if __name__ == '__main__':
    cli()
#+END_SRC

通过 ~@click.group~ 来定义某个命令组，然后通过这个命令组函数的command方法 ~@cli.command()~ 来添加某个子命令。



* 命令行选项详解
click模块必填参数通过 ~argument()~ 引入，然后可选参数通过 ~option()~ 引入，这里值得一提的是这两个函数的参数并不完全一样，比如说option可以跟 ~prompt~ 来做到当该可选参数没有输入的时候，则请求输入；但argument并无此概念。更多细节请参看下面的请求输入一小节。

** default
设置默认值，显然argument必填参数无此概念。

** type
控制数据类型，这个都有。

** 接受多个输入
~nargs~ 如果设置为大于等于1的值，则命令行中要刷入这么多值，这个和argparse模块类似，不同的是不定量的多个值的情况是 ~nargs=-1~ ，相当于内置模块argparse的 ~*~ 。然后对应argparse的 ~+~ 也就是必须要有一个以上的值的情况，则需要额外加上 ~required=True~ 来控制。

** count
这个是option有，在某种情景下可能很有用。
#+BEGIN_EXAMPLE
@click.command()
@click.option('-v', '--verbose', count=True)
def log(verbose):
    click.echo('Verbosity: %s' % verbose)
$ log -vvv
Verbosity: 3
#+END_EXAMPLE

** 布尔值
如果默认 ~default=True~ 这样设置了，那么默认就是存储的布尔值了，其实际上暗含加上了 ~is_flag=True~ 。所以如果没有设置default，则可以通过 ~is_flag~ 来控制具体存储的是布尔值。

** 短名选项和长名选项和布尔值
#+BEGIN_EXAMPLE
import sys

@click.command()
@click.option('--shout/--no-shout', ' /-S', default=False)
def info(shout):
    rv = sys.platform
    if shout:
        rv = rv.upper() + '!!!!111'
    click.echo(rv)
#+END_EXAMPLE

#+BEGIN_EXAMPLE
bash>>> python3 test.py 
linux
bash>>> python3 test.py --shout
LINUX!!!!111
bash>>> python3 test.py -S
linux
#+END_EXAMPLE

也就是通过上面的这种 ~/~ 分割语句来创建这种多个flag的布尔值控制，其中 ~/~ 左边是True，右边是False，然后短名选项跟着写入就是了。 *注意* 上面例子短名情况前面的空格是不可少的。

