电脑/python/python第三方模块/click模块.html

<div class="outline-2">
<h2 id="orgheadline3">必填参数，文件操作和如何测试</h2>
<div class="outline-text-2" id="text-2">
<p>
必填参数用 <code>@click.argument()</code> 来装饰添加之，如下所示:
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">click</span>

<span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.argument</span><span class="p">(</span><span class="s1">&#39;input&#39;</span><span class="p">,</span> <span class="nb">type</span><span class="o">=</span><span class="n">click</span><span class="o">.</span><span class="n">File</span><span class="p">(</span><span class="s1">&#39;rb&#39;</span><span class="p">))</span>
<span class="nd">@click.argument</span><span class="p">(</span><span class="s1">&#39;output&#39;</span><span class="p">,</span> <span class="nb">type</span><span class="o">=</span><span class="n">click</span><span class="o">.</span><span class="n">File</span><span class="p">(</span><span class="s1">&#39;wb&#39;</span><span class="p">))</span>
<span class="k">def</span> <span class="nf">inout</span><span class="p">(</span><span class="nb">input</span><span class="p">,</span> <span class="n">output</span><span class="p">):</span>
    <span class="k">while</span> <span class="bp">True</span><span class="p">:</span>
        <span class="n">chunk</span> <span class="o">=</span> <span class="nb">input</span><span class="o">.</span><span class="n">read</span><span class="p">(</span><span class="mi">1024</span><span class="p">)</span>
        <span class="k">if</span> <span class="ow">not</span> <span class="n">chunk</span><span class="p">:</span>
            <span class="k">break</span>
        <span class="n">output</span><span class="o">.</span><span class="n">write</span><span class="p">(</span><span class="n">chunk</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">inout</span><span class="p">()</span>
</pre></div>

<p>
这里的 <code>click.File()</code> 接受一个文件名，然后就已经打开了，在函数里面直接作为一个文件对象可以使用了。文件就推荐使用click模块的这个类型来处理，其对Unicode和bytes处理较好，并有其他优化。当然你也可以使用 <code>click.Path</code> 类型，其在函数里面相当于一个优化的Path文件名，同样提供了Unicode和bytes兼容支持等。
</p>

<div class="highlight"><pre><span></span><span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.argument</span><span class="p">(</span><span class="s1">&#39;f&#39;</span><span class="p">,</span> <span class="nb">type</span><span class="o">=</span><span class="n">click</span><span class="o">.</span><span class="n">Path</span><span class="p">(</span><span class="n">exists</span><span class="o">=</span><span class="bp">True</span><span class="p">))</span>
<span class="k">def</span> <span class="nf">touch</span><span class="p">(</span><span class="n">f</span><span class="p">):</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="n">click</span><span class="o">.</span><span class="n">format_filename</span><span class="p">(</span><span class="n">f</span><span class="p">))</span>
</pre></div>

<p>
在上面的例子中我们看到脚本最后那里写上:
</p>
<pre>
if __name__ == '__main__':
    inout()
</pre>
<p>
脚本就可以正常测试了:
</p>
<pre>
bash&gt;&gt;&gt; python3 test5.py test.py output.txt
</pre>

<p>
但是更好的做法是用测试式开发风格:
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">click</span>

<span class="kn">from</span> <span class="nn">click.testing</span> <span class="kn">import</span> <span class="n">CliRunner</span>

<span class="k">def</span> <span class="nf">test_inout</span><span class="p">():</span>
    <span class="nd">@click.command</span><span class="p">()</span>
    <span class="nd">@click.argument</span><span class="p">(</span><span class="s1">&#39;input&#39;</span><span class="p">,</span> <span class="nb">type</span><span class="o">=</span><span class="n">click</span><span class="o">.</span><span class="n">File</span><span class="p">(</span><span class="s1">&#39;rb&#39;</span><span class="p">))</span>
    <span class="nd">@click.argument</span><span class="p">(</span><span class="s1">&#39;output&#39;</span><span class="p">,</span> <span class="nb">type</span><span class="o">=</span><span class="n">click</span><span class="o">.</span><span class="n">File</span><span class="p">(</span><span class="s1">&#39;wb&#39;</span><span class="p">))</span>
    <span class="k">def</span> <span class="nf">inout</span><span class="p">(</span><span class="nb">input</span><span class="p">,</span> <span class="n">output</span><span class="p">):</span>
        <span class="k">while</span> <span class="bp">True</span><span class="p">:</span>
            <span class="n">chunk</span> <span class="o">=</span> <span class="nb">input</span><span class="o">.</span><span class="n">read</span><span class="p">(</span><span class="mi">1024</span><span class="p">)</span>
            <span class="k">if</span> <span class="ow">not</span> <span class="n">chunk</span><span class="p">:</span>
                <span class="k">break</span>
            <span class="n">output</span><span class="o">.</span><span class="n">write</span><span class="p">(</span><span class="n">chunk</span><span class="p">)</span>

    <span class="n">runner</span> <span class="o">=</span> <span class="n">CliRunner</span><span class="p">()</span>

    <span class="k">with</span> <span class="n">runner</span><span class="o">.</span><span class="n">isolated_filesystem</span><span class="p">():</span>
        <span class="n">string</span> <span class="o">=</span> <span class="s1">&#39;Hello World!&#39;</span>
        <span class="k">with</span> <span class="nb">open</span><span class="p">(</span><span class="s1">&#39;hello.txt&#39;</span><span class="p">,</span> <span class="s1">&#39;w&#39;</span><span class="p">)</span> <span class="k">as</span> <span class="n">f</span><span class="p">:</span>
            <span class="n">f</span><span class="o">.</span><span class="n">write</span><span class="p">(</span><span class="n">string</span><span class="p">)</span>

        <span class="n">result</span> <span class="o">=</span> <span class="n">runner</span><span class="o">.</span><span class="n">invoke</span><span class="p">(</span><span class="n">inout</span><span class="p">,</span> <span class="p">[</span><span class="s1">&#39;hello.txt&#39;</span><span class="p">,</span><span class="s1">&#39;hello2.txt&#39;</span><span class="p">])</span>

        <span class="k">assert</span> <span class="n">result</span><span class="o">.</span><span class="n">exit_code</span> <span class="o">==</span> <span class="mi">0</span>
        <span class="k">with</span> <span class="nb">open</span><span class="p">(</span><span class="s1">&#39;hello2.txt&#39;</span><span class="p">,</span><span class="s1">&#39;r&#39;</span><span class="p">)</span> <span class="k">as</span> <span class="n">f</span><span class="p">:</span>
            <span class="n">s</span> <span class="o">=</span> <span class="n">f</span><span class="o">.</span><span class="n">read</span><span class="p">()</span>
            <span class="k">assert</span> <span class="n">s</span> <span class="o">==</span> <span class="n">string</span>


<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">test_inout</span><span class="p">()</span>
</pre></div>

<p>
具体是新建一个 <code>CliRunner</code> 对象，然后调用其 <code>invoke</code> 方法来具体执行某个命令，然后的 <code>Result</code> 对象有 <code>exit_code</code> 和 <code>output</code> 等属性。其中 <code>result.output</code> 一般为屏幕回显的文字。
</p>

<p>
然后我们看到上面的runner调用了 <code>isolated_filesystem()</code> 方法，通过暂停程序我们会发现这样在 <code>/tmp</code> 文件夹里面会出现一个临时文件夹，然后一切文件操作都在里面进行，完了就会被删除。
</p>
</div>


<div class="outline-3">
<h3 id="orgheadline2">标准输入和标准输出</h3>
<div class="outline-text-3" id="text-2-1">
<p>
值得一提的是标准输入和标准输出可以用 '-' 简单表示。比如上面的例子:
</p>
<pre>
bash&gt;&gt;&gt; python3 test4.py - output.txt
test test

bash&gt;&gt;&gt; python3 test4.py test.py -
</pre>

<p>
标准输入的那个例子你需要按下 <code>Ctrl-D</code> 来结束文件流。
</p>
</div>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline4">分组和多个子命令</h2>
<div class="outline-text-2" id="text-3">
<p>
click模块在分组和建立多个子命令功能上也设计得很简洁:
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">click</span>

<span class="nd">@click.group</span><span class="p">()</span>
<span class="k">def</span> <span class="nf">cli</span><span class="p">():</span>
    <span class="k">pass</span>

<span class="nd">@cli.command</span><span class="p">()</span>
<span class="k">def</span> <span class="nf">initdb</span><span class="p">():</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Initialized the database&#39;</span><span class="p">)</span>

<span class="nd">@cli.command</span><span class="p">()</span>
<span class="k">def</span> <span class="nf">dropdb</span><span class="p">():</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Dropped the database&#39;</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">cli</span><span class="p">()</span>
</pre></div>

<p>
通过 <code>@click.group</code> 来定义某个命令组，然后通过这个命令组函数的command方法 <code>@cli.command()</code> 来添加某个子命令。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline15">命令行选项详解</h2>
<div class="outline-text-2" id="text-4">
<p>
click模块必填参数通过 <code>argument()</code> 引入，然后可选参数通过 <code>option()</code> 引入，这里值得一提的是这两个函数的参数并不完全一样，比如说option可以跟 <code>prompt</code> 来做到当该可选参数没有输入的时候，则请求输入；但argument并无此概念。更多细节请参看下面的请求输入一小节。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline5">default</h3>
<div class="outline-text-3" id="text-4-1">
<p>
设置默认值，显然argument必填参数无此概念。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline6">type</h3>
<div class="outline-text-3" id="text-4-2">
<p>
控制数据类型，这个都有。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline7">接受多个输入</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<code>nargs</code> 如果设置为大于等于1的值，则命令行中要刷入这么多值，这个和argparse模块类似，不同的是不定量的多个值的情况是 <code>nargs=-1</code> ，相当于内置模块argparse的 <code>*</code> 。然后对应argparse的 <code>+</code> 也就是必须要有一个以上的值的情况，则需要额外加上 <code>required=True</code> 来控制。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline8">count</h3>
<div class="outline-text-3" id="text-4-4">
<p>
这个是option有，在某种情景下可能很有用。
</p>
<pre>
@click.command()
@click.option('-v', '--verbose', count=True)
def log(verbose):
    click.echo('Verbosity: %s' % verbose)
$ log -vvv
Verbosity: 3
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline9">布尔值</h3>
<div class="outline-text-3" id="text-4-5">
<p>
如果默认 <code>default=True</code> 这样设置了，那么默认就是存储的布尔值了，其实际上暗含加上了 <code>is_flag=True</code> 。所以如果没有设置default，则可以通过 <code>is_flag</code> 来控制具体存储的是布尔值。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline10">短名选项和长名选项和布尔值</h3>
<div class="outline-text-3" id="text-4-6">
<pre>
import sys

@click.command()
@click.option('--shout/--no-shout', ' /-S', default=False)
def info(shout):
    rv = sys.platform
    if shout:
        rv = rv.upper() + '!!!!111'
    click.echo(rv)
</pre>

<pre>
bash&gt;&gt;&gt; python3 test.py 
linux
bash&gt;&gt;&gt; python3 test.py --shout
LINUX!!!!111
bash&gt;&gt;&gt; python3 test.py -S
linux
</pre>

<p>
也就是通过上面的这种 <code>/</code> 分割语句来创建这种多个flag的布尔值控制，其中 <code>/</code> 左边是True，右边是False，然后短名选项跟着写入就是了。 <strong>注意</strong> 上面例子短名情况前面的空格是不可少的。
</p>
</div>
</div>
