电脑/python/python第三方模块/click模块.org
** 多个choice选项的用法
#+BEGIN_SRC python
@click.command()
@click.option('--hash-type', type=click.Choice(['md5', 'sha1']))
def digest(hash_type):
    click.echo(hash_type)
#+END_SRC

** 请求输入prompt控制
这个只是option才有的概念。最简单的情况如下所示:
#+BEGIN_SRC python
@click.command()
@click.option('--name', prompt='Your name please')
def hello(name):
    click.echo('Hello %s!' % name)
#+END_SRC

弹出提示只有在你没有输入 ~--name=~ 给出值时才会出来。

*** 请求输入密码
如下所示:
#+BEGIN_SRC python
@click.command()
@click.option('--password', prompt=True, hide_input=True,
              confirmation_prompt=True)
def encrypt(password):
    click.echo('Encrypting password to %s' % password.encode('rot13'))
#+END_SRC

也就是额外加上了两个选项控制: ~hide_input=True~ 和 ~confirmation_prompt=True~ 。上面的这种组合可以简单写为:
#+BEGIN_SRC python
@click.command()
@click.password_option()
def encrypt(password):
    click.echo('Encrypting password to %s' % password.encode('rot13'))
#+END_SRC

*** 请求的默认值控制
请求prompt是可以通过 ~default~ 来设置默认值的，在那种情况下你直接按下Enter就相当于输入默认值了。然后你还可以如下来获取系统环境下的某个值作为默认值。

#+BEGIN_SRC python
@click.command()
@click.option('--username', prompt=True,
              default=lambda: os.environ.get('USER', ''))
def hello(username):
    print("Hello,", username)
#+END_SRC

此外click模块还提供了如下的prompt快捷请求输入命令。
#+BEGIN_EXAMPLE
value = click.prompt('Please enter a valid integer', type=int)
#+END_EXAMPLE

还有如下的 ~confirm~ 函数也很有用:
#+BEGIN_EXAMPLE
if click.confirm('Do you want to continue?'):
    click.echo('Well done!')
#+END_EXAMPLE

* 全局环境变量控制

* 命令行选项控制其他动作
如下所示，通过 ~is_eager=True~ 来让该选项优先级高于其他选项。然后 ~expose_value=False~ 意思是如果没有输入这个选项，则不影响原命令的执行流。然后 ~callback~ 就是具体要跳转到的那个函数上。
#+BEGIN_SRC python
def print_version(ctx, param, value):
    if not value or ctx.resilient_parsing:
        return
    click.echo('Version 1.0')
    ctx.exit()

@click.command()
@click.option('--version', is_flag=True, callback=print_version,
              expose_value=False, is_eager=True)
def hello():
    click.echo('Hello World!')
#+END_SRC

这里最关键性的问题是理解 ~ctx~ ~param~ 和 ~value~ 这几个参数。



* 带颜色的终端回显
click借助python模块 ~colorama~ 的力量有在终端显示带颜色的字体的功能，首先确认按照了 ~colorama~ :
#+BEGIN_EXAMPLE
pip install colorama
#+END_EXAMPLE

简单的使用就是:
#+BEGIN_EXAMPLE
import click

click.secho('Hello World!', fg='green')
click.secho('Some more text', bg='white', fg='black')
click.secho('ATTENTION', blink=True, bold=True)
#+END_EXAMPLE

其中fg是前景颜色，也可以说字体颜色吧，颜色选项有:
#+BEGIN_EXAMPLE
Fore: BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, WHITE.
#+END_EXAMPLE

然后bg是背景颜色:
#+BEGIN_EXAMPLE
Back: BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, WHITE.
#+END_EXAMPLE

然后还有其他一些style:
#+BEGIN_EXAMPLE
dim=True
bold=True
blink=True
underline=True
reverse=True
#+END_EXAMPLE

其中dim是淡化，bold是加粗，blink意思应该是闪烁，但是没看到效果。underline是下划线，reverse是前景色和背景色翻转。

