电脑/python/python第三方模块/click模块.html

<div class="outline-3">
<h3 id="orgheadline11">多个choice选项的用法</h3>
<div class="outline-text-3" id="text-4-7">
<div class="highlight"><pre><span></span><span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--hash-type&#39;</span><span class="p">,</span> <span class="nb">type</span><span class="o">=</span><span class="n">click</span><span class="o">.</span><span class="n">Choice</span><span class="p">([</span><span class="s1">&#39;md5&#39;</span><span class="p">,</span> <span class="s1">&#39;sha1&#39;</span><span class="p">]))</span>
<span class="k">def</span> <span class="nf">digest</span><span class="p">(</span><span class="n">hash_type</span><span class="p">):</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="n">hash_type</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline14">请求输入prompt控制</h3>
<div class="outline-text-3" id="text-4-8">
<p>
这个只是option才有的概念。最简单的情况如下所示:
</p>
<div class="highlight"><pre><span></span><span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--name&#39;</span><span class="p">,</span> <span class="n">prompt</span><span class="o">=</span><span class="s1">&#39;Your name please&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">hello</span><span class="p">(</span><span class="n">name</span><span class="p">):</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Hello </span><span class="si">%s</span><span class="s1">!&#39;</span> <span class="o">%</span> <span class="n">name</span><span class="p">)</span>
</pre></div>

<p>
弹出提示只有在你没有输入 <code>--name=</code> 给出值时才会出来。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline12">请求输入密码</h4>
<div class="outline-text-4" id="text-4-8-1">
<p>
如下所示:
</p>
<div class="highlight"><pre><span></span><span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--password&#39;</span><span class="p">,</span> <span class="n">prompt</span><span class="o">=</span><span class="bp">True</span><span class="p">,</span> <span class="n">hide_input</span><span class="o">=</span><span class="bp">True</span><span class="p">,</span>
              <span class="n">confirmation_prompt</span><span class="o">=</span><span class="bp">True</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">encrypt</span><span class="p">(</span><span class="n">password</span><span class="p">):</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Encrypting password to </span><span class="si">%s</span><span class="s1">&#39;</span> <span class="o">%</span> <span class="n">password</span><span class="o">.</span><span class="n">encode</span><span class="p">(</span><span class="s1">&#39;rot13&#39;</span><span class="p">))</span>
</pre></div>

<p>
也就是额外加上了两个选项控制: <code>hide_input=True</code> 和 <code>confirmation_prompt=True</code> 。上面的这种组合可以简单写为:
</p>
<div class="highlight"><pre><span></span><span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.password_option</span><span class="p">()</span>
<span class="k">def</span> <span class="nf">encrypt</span><span class="p">(</span><span class="n">password</span><span class="p">):</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Encrypting password to </span><span class="si">%s</span><span class="s1">&#39;</span> <span class="o">%</span> <span class="n">password</span><span class="o">.</span><span class="n">encode</span><span class="p">(</span><span class="s1">&#39;rot13&#39;</span><span class="p">))</span>
</pre></div>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline13">请求的默认值控制</h4>
<div class="outline-text-4" id="text-4-8-2">
<p>
请求prompt是可以通过 <code>default</code> 来设置默认值的，在那种情况下你直接按下Enter就相当于输入默认值了。然后你还可以如下来获取系统环境下的某个值作为默认值。
</p>

<div class="highlight"><pre><span></span><span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--username&#39;</span><span class="p">,</span> <span class="n">prompt</span><span class="o">=</span><span class="bp">True</span><span class="p">,</span>
              <span class="n">default</span><span class="o">=</span><span class="k">lambda</span><span class="p">:</span> <span class="n">os</span><span class="o">.</span><span class="n">environ</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s1">&#39;USER&#39;</span><span class="p">,</span> <span class="s1">&#39;&#39;</span><span class="p">))</span>
<span class="k">def</span> <span class="nf">hello</span><span class="p">(</span><span class="n">username</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s2">&quot;Hello,&quot;</span><span class="p">,</span> <span class="n">username</span><span class="p">)</span>
</pre></div>

<p>
此外click模块还提供了如下的prompt快捷请求输入命令。
</p>
<pre>
value = click.prompt('Please enter a valid integer', type=int)
</pre>

<p>
还有如下的 <code>confirm</code> 函数也很有用:
</p>
<pre>
if click.confirm('Do you want to continue?'):
    click.echo('Well done!')
</pre>
</div>
</div>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline16">全局环境变量控制</h2>
</div>

<div class="outline-2">
<h2 id="orgheadline17">命令行选项控制其他动作</h2>
<div class="outline-text-2" id="text-6">
<p>
如下所示，通过 <code>is_eager=True</code> 来让该选项优先级高于其他选项。然后 <code>expose_value=False</code> 意思是如果没有输入这个选项，则不影响原命令的执行流。然后 <code>callback</code> 就是具体要跳转到的那个函数上。
</p>
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="nf">print_version</span><span class="p">(</span><span class="n">ctx</span><span class="p">,</span> <span class="n">param</span><span class="p">,</span> <span class="n">value</span><span class="p">):</span>
    <span class="k">if</span> <span class="ow">not</span> <span class="n">value</span> <span class="ow">or</span> <span class="n">ctx</span><span class="o">.</span><span class="n">resilient_parsing</span><span class="p">:</span>
        <span class="k">return</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Version 1.0&#39;</span><span class="p">)</span>
    <span class="n">ctx</span><span class="o">.</span><span class="n">exit</span><span class="p">()</span>

<span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s1">&#39;--version&#39;</span><span class="p">,</span> <span class="n">is_flag</span><span class="o">=</span><span class="bp">True</span><span class="p">,</span> <span class="n">callback</span><span class="o">=</span><span class="n">print_version</span><span class="p">,</span>
              <span class="n">expose_value</span><span class="o">=</span><span class="bp">False</span><span class="p">,</span> <span class="n">is_eager</span><span class="o">=</span><span class="bp">True</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">hello</span><span class="p">():</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s1">&#39;Hello World!&#39;</span><span class="p">)</span>
</pre></div>

<p>
这里最关键性的问题是理解 <code>ctx</code> <code>param</code> 和 <code>value</code> 这几个参数。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline18">带颜色的终端回显</h2>
<div class="outline-text-2" id="text-7">
<p>
click借助python模块 <code>colorama</code> 的力量有在终端显示带颜色的字体的功能，首先确认按照了 <code>colorama</code> :
</p>
<pre>
pip install colorama
</pre>

<p>
简单的使用就是:
</p>
<pre>
import click

click.secho('Hello World!', fg='green')
click.secho('Some more text', bg='white', fg='black')
click.secho('ATTENTION', blink=True, bold=True)
</pre>

<p>
其中fg是前景颜色，也可以说字体颜色吧，颜色选项有:
</p>
<pre>
Fore: BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, WHITE.
</pre>

<p>
然后bg是背景颜色:
</p>
<pre>
Back: BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, WHITE.
</pre>

<p>
然后还有其他一些style:
</p>
<pre>
dim=True
bold=True
blink=True
underline=True
reverse=True
</pre>

<p>
其中dim是淡化，bold是加粗，blink意思应该是闪烁，但是没看到效果。underline是下划线，reverse是前景色和背景色翻转。
</p>
</div>
</div>
</div>
</body>
</html>
